results/routeA/initialization_check/A-Ra1e5-fine/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
25600
(
-0.004401408450704226
-0.004401408450704226
-0.004401408450704226
-0.004401408450704226
-0.004401408450704226
-0.004401408450704226
-0.004401408450704226
-0.004401408450704226
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.004399207746478873
-0.01319762323943662
-0.02199603873239437
-0.03079445422535211
-0.03959286971830986
-0.04839128521126761
-0.05718970070422535
-0.0659881161971831
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.004403609154929577
-0.01321082746478873
-0.02201804577464789
-0.03082526408450704
-0.0396324823943662
-0.04843970070422535
-0.0572469190140845
-0.06605413732394366
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform -1.408450704225352;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
