results/routeA/initialization_check/A-Ra1e5-fine/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
25600
(
0
0
0
0
-8.673617379884035e-19
8.673617379884035e-19
1.734723475976807e-18
0
...
)
;

boundaryField
{
    hotWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
160
(
8.673617379884035e-19
0
-3.469446951953614e-18
0
1.387778780781446e-17
6.938893903907228e-18
0
1.387778780781446e-17
...
)
;
    }
    coldWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
160
(
0
0
-6.938893903907228e-18
0
0
0
-1.387778780781446e-17
-1.387778780781446e-17
...
)
;
    }
    bottomWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    topWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
160
(
-2.220446049250313e-16
-2.220446049250313e-16
-2.220446049250313e-16
-2.220446049250313e-16
-2.220446049250313e-16
0
0
0
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
