results/routeA/initialization_check/A-Ra1e5-fine/0/gh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
25600
(
-0.004401408450704226
-0.004401408450704226
-0.004401408450704226
-0.004401408450704226
-0.004401408450704225
-0.004401408450704226
-0.004401408450704227
-0.004401408450704226
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.004401408450704226
-0.01320422535211268
-0.02200704225352112
-0.03080985915492958
-0.03961267605633804
-0.04841549295774648
-0.05721830985915493
-0.06602112676056339
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.004401408450704226
-0.01320422535211268
-0.02200704225352112
-0.03080985915492958
-0.03961267605633803
-0.04841549295774648
-0.05721830985915492
-0.06602112676056338
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
